{
"Magadha1":"According to several legends, Chanakya traveled to Magadha, a kingdom that was large and militarily powerful and feared by its neighbors, but was insulted by its king Dhana Nanda, of the Nanda Dynasty",
"Nanda1":"The Nanda Empire originated from the region of Magadha in ancient India during the 5th and 4th centuries BCE. At its greatest extent, the Nanda Empire extended from Bengal in the east, to Punjab in the west and as far south as the Vindhya Range. The Nanda Empire was later conquered by Chandragupta Maurya, who founded the Maurya Empire",
"1":"<p>Ashoka was born in 304 B.C to the Mauryan emperor Bindusara and his queen, Dharmā [or Dhammā] He was the grandson of Chandragupta Maurya, founder of Mauryan dynasty </p> <p>Ashokāvadāna states that his mother was a queen named Subhadrangī, the daughter of Champa of Telangana. Queen Subhadrangī was a Brahmin of the Ajivika sect. Sage Pilindavatsa (aias Janasana) was a kalupaga Brahmin of the Ajivika sect had found Subhadrangī as a suitable match for Emperor Bindusara. A palace intrigue kept her away from the king. This eventually ended, and she bore a son. It is from her exclamation 'I am now without sorrow', that Ashoka got his name. The Divyāvadāna tells a similar story, but gives the name of the queen as Janapadakalyānī. Ashoka had several elder siblings, all of whom were his half-brothers from other wives of Bindusāra.</p>",
"3":"The main reasons for invading Kalinga were both political and economic.[5] Since the time of Ashoka's father, King Bindusara, the Mauryan Empire based in Magadha was following a policy of territorial expansion. Kalinga was under Magadha control during the Nanda rule, but regained independence with the beginning of the rule of the Mauryas. That was considered a great setback for the traditional policy of territorial expansion of the Magadhan emperors and was considered to be a loss of political prestige for the Mauryas merely imperative to reduce Kalinga to complete subjection."
}